<a target="_blank" href="https://colab.research.google.com/github/lukebarousse/Int_SQL_Data_Analytics_Course/blob/main/1_Pivot_With_Case_Statements/2_Conditional_Aggregation.ipynb">
  <img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/>
</a>

# Conditional Aggregation

**Product focused**

## Overview

### ü•Ö Analysis Goals

Use the following to do an EDA of the products and their categories ordered from the `sales` table.
- Compare total sales of products ordered in 2023 and 2022
- Total sales in 2023 and 2022.
- Categorize sales as low, moderate or high and pivot the sales by category and year.

### üìò Concepts Covered

- `SUM` Review
- `SUM` with `CASE WHEN`
- Pivot with Multiple CASE WHEN Statements

---

In [1]:
import sys
import matplotlib.pyplot as plt
%matplotlib inline

# If running in Google Colab, install PostgreSQL and restore the database
if 'google.colab' in sys.modules:
    # Install PostgreSQL
    !sudo apt-get install postgresql -qq > /dev/null 2>&1

    # Start PostgreSQL service (suppress output)
    !sudo service postgresql start > /dev/null 2>&1

    # Set password for the 'postgres' user to avoid authentication errors (suppress output)
    !sudo -u postgres psql -c "ALTER USER postgres WITH PASSWORD 'password';" > /dev/null 2>&1

    # Create the 'colab_db' database (suppress output)
    !sudo -u postgres psql -c "CREATE DATABASE contoso_100k;" > /dev/null 2>&1

    # Download the PostgreSQL .sql dump
    !wget -q -O contoso_100k.sql https://github.com/lukebarousse/Int_SQL_Data_Analytics_Course/releases/download/v.0.0.0/contoso_100k.sql

    # Restore the dump file into the PostgreSQL database (suppress output)
    !sudo -u postgres psql contoso_100k < contoso_100k.sql > /dev/null 2>&1

    # Shift libraries from ipython-sql to jupysql
    !pip uninstall -y ipython-sql > /dev/null 2>&1
    !pip install jupysql > /dev/null 2>&1

# Load the ipython-sql extension for SQL magic
%load_ext sql

# Connect to the PostgreSQL database
%sql postgresql://postgres:password@localhost:5432/contoso_100k

# Enable automatic conversion of SQL results to pandas DataFrames
%config SqlMagic.autopandas = True

# Disable named parameters for SQL magic
%config SqlMagic.named_parameters = "disabled"

# Set up the connection parameters for this notebook
import psycopg2
import pandas as pd
import numpy as np

# Database connection parameters
connection = psycopg2.connect(
    dbname='contoso_100k',
    user='postgres',
    password='password',
    host='localhost',
    port='5432'
)

Connecting to 'postgresql://postgres:***@localhost:5432/contoso_100k'

---
## SUM Review

### üìù¬†Notes

- Add in specific notes

### üíª¬†Final Result

- Describe what the final result should be e.g. return the retention by X cohort.

#### Total Net Revenue by Day in 2023

**`SUM`**

1. Find the net revenue by orderdate for 2023 orders.

In [3]:
%%sql

SELECT
    s.orderdate,
    SUM(s.quantity * s.netprice * s.exchangerate) AS net_revenue -- Added
FROM
    sales s
WHERE
    s.orderdate::date BETWEEN '2023-01-01' AND '2023-12-31'
GROUP BY   
    s.orderdate
ORDER BY
    s.orderdate

Running query in 'postgresql://postgres:***@localhost:5432/contoso_100k'

364 rows affected.

      orderdate    net_revenue
0    2023-01-01   30140.799315
1    2023-01-02  107847.490191
2    2023-01-03  192655.596657
3    2023-01-04  189451.707871
4    2023-01-05  216573.229817
..          ...            ...
359  2023-12-27  141981.336234
360  2023-12-28  138772.189742
361  2023-12-29   85913.440327
362  2023-12-30  165917.019796
363  2023-12-31    5594.655048

[364 rows x 2 columns]

#### Total Net Revenue by Product Category in 2023 and 2022

**`SUM`**

1. Find the total net revenue by the product category for 2023 orders.

In [ ]:
%%sql

SELECT
    p.categoryname AS category_name, -- Added
WHERE
    SUM(s.quantity * s.netprice * s.exchangerate) AS net_revenue
FROM
    sales s
    LEFT JOIN product p ON s.productkey = p.productkey -- Added
WHERE
    s.orderdate::date BETWEEN '2023-01-01' AND '2023-12-31'
GROUP BY
    p.categoryname -- Update
ORDER BY
    p.categoryname -- Update

Running query in 'postgresql://postgres:***@localhost:5432/contoso_100k'

8 rows affected.

                   category_name   net_revenue
0                          Audio  6.886902e+05
1        Cameras and camcorders   1.983546e+06
2                    Cell phones  6.002148e+06
3                      Computers  1.165087e+07
4                 Games and Toys  2.703750e+05
5                Home Appliances  5.919993e+06
6  Music, Movies and Audio Books  2.180768e+06
7                   TV and Video  4.412178e+06

2. Find the total net revenue by the product category for 2022 orders.

In [5]:
%%sql

SELECT
    p.categoryname AS category_name,
    SUM(s.quantity * s.netprice * s.exchangerate) AS net_revenue
FROM
    sales s
    LEFT JOIN product p ON s.productkey = p.productkey
WHERE
    s.orderdate::date BETWEEN '2022-01-01' AND '2022-12-31' -- Updated
GROUP BY
    p.categoryname
ORDER BY
    p.categoryname

Running query in 'postgresql://postgres:***@localhost:5432/contoso_100k'

8 rows affected.

                   category_name   net_revenue
0                          Audio  7.669382e+05
1        Cameras and camcorders   2.382533e+06
2                    Cell phones  8.119665e+06
3                      Computers  1.786221e+07
4                 Games and Toys  3.161273e+05
5                Home Appliances  6.612447e+06
6  Music, Movies and Audio Books  2.989297e+06
7                   TV and Video  5.815337e+06

---
## SUM with CASE WHEN

### üìù¬†Notes

- Add in specific notes

### üíª¬†Final Result

- Describe what the final result should be e.g. return the retention by X cohort.

#### Total Sales by Category and Year (2022 vs 2023)

**`CASE WHEN` and `SUM`**

1. Pivot to get the total sales by category and compare 2023 with 2022.

In [6]:
%%sql 

SELECT
    p.categoryname AS category,
    SUM(CASE WHEN s.orderdate::date BETWEEN '2023-01-01' AND '2023-12-31' THEN (s.quantity * s.netprice * s.exchangerate) END) AS y2023_total_sales,
    SUM(CASE WHEN s.orderdate::date BETWEEN '2022-01-01' AND '2022-12-31' THEN (s.quantity * s.netprice * s.exchangerate) END) AS y2022_total_sales
FROM
    sales s
    LEFT JOIN product p ON s.productkey = p.productkey
GROUP BY
    p.categoryname
ORDER BY
    p.categoryname;

Running query in 'postgresql://postgres:***@localhost:5432/contoso_100k'

8 rows affected.

                        category  y2023_total_sales  y2022_total_sales
0                          Audio       6.886902e+05       7.669382e+05
1        Cameras and camcorders        1.983546e+06       2.382533e+06
2                    Cell phones       6.002148e+06       8.119665e+06
3                      Computers       1.165087e+07       1.786221e+07
4                 Games and Toys       2.703750e+05       3.161273e+05
5                Home Appliances       5.919993e+06       6.612447e+06
6  Music, Movies and Audio Books       2.180768e+06       2.989297e+06
7                   TV and Video       4.412178e+06       5.815337e+06

---
## Pivot with Multiple CASE WHEN Statements

### üìù¬†Notes

- Add in specific notes

### üíª¬†Final Result

- Describe what the final result should be e.g. return the retention by X cohort.

#### Categorize as Low and High for Total Sale

**`FUNCTION` / Concept Covered**

1. Find the median for a single total sale made in 2022 and 2023.

To categorize sales into low, moderate, and high, we'll use the 25th percentile (Q1) and 75th percentile (Q3). It lets us segment the data into three meaningful categories, instead of guessing:

- **Low**: Below the 25th percentile (Q1).
- **Moderate**: Between the 25th and 75th percentiles (Q1 and Q3).
- **High**: Above the 75th percentile (Q3).

To calculate the percentiles (25th, 50th, and 75th) 
- **`PERCENTILE_CONT`** calculates a percentile (e.g., 25th, 50th, 75th) by estimating values between sorted data points.  
- Syntax:
```sql
SELECT 
  PERCENTILE_CONT(0.5) WITHIN GROUP (ORDER BY column_name) AS median
FROM table_name
WHERE column_name IS NOT NULL;
```

In [7]:
%%sql 

SELECT
    PERCENTILE_CONT(0.5) WITHIN GROUP (ORDER BY (s.quantity * s.netprice * exchangerate)) AS median
FROM
    sales s
WHERE
    orderdate::date BETWEEN '2022-01-01' AND '2023-12-31' 
;

Running query in 'postgresql://postgres:***@localhost:5432/contoso_100k'

1 rows affected.

   median
0   398.0

2. **Validate data**. Validating data another way using Python.

**Note for Luke**: We could also say they could export the data in Excel but it might not load quickly on their computer.

In [9]:
# SQL Query to fetch data
query = '''
SELECT 
    s.quantity * s.netprice * exchangerate AS net_revenue
FROM 
    sales s
WHERE
    orderdate::date BETWEEN '2022-01-01' AND '2023-12-31' 
ORDER BY 
    net_revenue;
'''

# Fetch data into a Pandas DataFrame
sales_df = pd.read_sql_query(query, connection)

import warnings

# Suppress specific warning from Pandas about psycopg2
warnings.filterwarnings(
    'ignore',
    category=UserWarning,
    message=".*only supports SQLAlchemy connectable.*"
)


# Calculate percentiles
median = np.percentile(sales_df, 50)

print(f"25th Percentile (Q1): {median}")

25th Percentile (Q1): 398.0

3. Pivot by category and then categorize the sale into low, moderate and high based on the 25th, 50th, and 75th percentile for sales in 2022 and 2023. Then get the total sale amount.

In [10]:
%%sql 

SELECT
    p.categoryname AS category,
    SUM(CASE WHEN (s.quantity * s.netprice * exchangerate) < 398 THEN (s.quantity * s.netprice * exchangerate) END) AS low_total_sales,
    SUM(CASE WHEN (s.quantity * s.netprice * exchangerate) >= 398 THEN (s.quantity * s.netprice * exchangerate) END) AS high_total_sales
FROM
    sales s
    LEFT JOIN product p ON s.productkey = p.productkey
WHERE
    orderdate::date BETWEEN '2022-01-01' AND '2023-12-31' 
GROUP BY
    category
ORDER BY
    category;

Running query in 'postgresql://postgres:***@localhost:5432/contoso_100k'

8 rows affected.

                        category  low_total_sales  high_total_sales
0                          Audio     4.025890e+05      1.053039e+06
1        Cameras and camcorders      2.378740e+05      4.128205e+06
2                    Cell phones     1.544149e+06      1.257766e+07
3                      Computers     1.215131e+06      2.829795e+07
4                 Games and Toys     4.380830e+05      1.484193e+05
5                Home Appliances     3.960584e+05      1.213638e+07
6  Music, Movies and Audio Books     1.260767e+06      3.909298e+06
7                   TV and Video     4.366136e+05      9.790901e+06

4. Add in the year to pivot by category, sale amount and year to compare 2023 vs 2022 sales for the sales label.

In [11]:
%%sql 

SELECT
    p.categoryname AS category,
    SUM(CASE WHEN (s.quantity * s.netprice * exchangerate) < 398
        AND orderdate::date BETWEEN '2023-01-01' AND '2023-12-31' THEN (s.quantity * s.netprice * exchangerate) END) AS y2023_low_total_sales,
    SUM(CASE WHEN (s.quantity * s.netprice * exchangerate) >= 398
        AND orderdate::date BETWEEN '2023-01-01' AND '2023-12-31' THEN (s.quantity * s.netprice * exchangerate) END) AS y2023_high_total_sales,
    SUM(CASE WHEN (s.quantity * s.netprice * exchangerate) < 398
        AND orderdate::date BETWEEN '2022-01-01' AND '2022-12-31' THEN (s.quantity * s.netprice * exchangerate) END) AS y2022_low_total_sales,
    SUM(CASE WHEN (s.quantity * s.netprice * exchangerate) >= 398 
        AND orderdate::date BETWEEN '2022-01-01' AND '2022-12-31' THEN (s.quantity * s.netprice * exchangerate) END) AS y2022_high_total_sales
FROM    
    sales s
    LEFT JOIN product p ON s.productkey = p.productkey
GROUP BY
    category
ORDER BY
    category;

Running query in 'postgresql://postgres:***@localhost:5432/contoso_100k'

8 rows affected.

,category,y2023_low_total_sales,y2023_high_total_sales,y2022_low_total_sales,y2022_high_total_sales
0,Audio,180251.127651,5.084391e+05,222337.826357,5.446004e+05
1,Cameras and camcorders,104869.455535,1.878677e+06,133004.539868,2.249528e+06
2,Cell phones,729699.394352,5.272448e+06,814449.529033,7.305216e+06
3,Computers,590790.306691,1.106008e+07,624340.418719,1.723787e+07
4,Games and Toys,206103.364757,6.427160e+04,231979.632972,8.414767e+04
5,Home Appliances,176261.350547,5.743732e+06,219797.072756,6.392650e+06
6,"Music, Movies and Audio Books",574958.761525,1.605809e+06,685808.485356,2.303489e+06
7,TV and Video,164275.353074,4.247903e+06,272338.286919,5.542998e+06

### üí° Note

You can also pivot with other aggregate functions though it is less common. Example: Here's our query from the last example using `AVG`, `MIN`, `MAX`.

**INSERT 3 QUERY EXAMPLES**